Revit 2027 API
CompoundStructure.SetMaterialId Method
 Sets a material element for a specified layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMaterialId(
	int layerIdx,
	ElementId materialId
)
Public Sub SetMaterialId (
	layerIdx As Integer,
	materialId As ElementId
)
public:
void SetMaterialId(
	int layerIdx,
	ElementId^ materialId
)
member SetMaterialId :
        layerIdx : int *
        materialId : ElementId -> unit
Parameters
layerIdx Int32
 Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
materialId ElementId
 The ElementId of a Material element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The layer index is out of range.
Remarks
 It is not verified that materialId corresponds to a valid Material element.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace